Model: "vgg16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         [(None, 244, 244, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 244, 244, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 244, 244, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 122, 122, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 122, 122, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 122, 122, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 61, 61, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 61, 61, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 61, 61, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 61, 61, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 30, 30, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 30, 30, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 30, 30, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 30, 30, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 15, 15, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 15, 15, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 15, 15, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 15, 15, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
=================================================================
Total params: 14,714,688
Trainable params: 14,714,688
Non-trainable params: 0
_________________________________________________________________
